tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Development kit for the Java programming language
brew "openjdk@11"
# General-purpose scripting language
brew "php", restart_service: true
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Cross-shell prompt for astronauts
brew "starship"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Reimagine your terminal
cask "fig"
# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-inter"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Customize mouse behavior
cask "linearmouse"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"

mas "Bitwarden", id: 1352778147
mas "Dropover", id: 1355679052
mas "TickTick", id: 966085870